Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier
Since:
2012
Level of computation for energy analysis model.
Since:
2012

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier.Final
Constructions, schedules, non-graphical data.

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier.SecondLevelBoundaries
Analytical surfaces.

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier.FirstLevelBoundaries
Spaces and zones, e.g. minimal need for display. This refers to the analytical spaces.
The analytical spaces are produced from Rooms if you are using RAC, and from MEP Spaces if you are using RME.

Autodesk.Revit.DB.Analysis.EnergyAnalysisDetailModelTier.NotComputed
Not computed.